# XMLSAXEndNode

## Description
Write XML using SAX, end of a node. [[VS:XMLSAXBeginNode| XMLSAXBeginNode]] begins a node.

```pascal
FUNCTION XMLSAXEndNode(XMLHandle : LONGINT): INTEGER;
```

```python
def vs.XMLSAXEndNode(XMLHandle):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT|   |

## Examples
[[VS:XMLSAXBeginDocFile]] or [[VS:XMLSAXBeginDocMemory]].

## Version
Availability: from Vectorworks 2011

## Category
* XML SAX